package droids;

public enum AiMode {
    AGGRESSIVE, // Атака за будь-яку ціну
    DEFENSIVE,  // Пріоритет виживанню
    TACTICAL    // Розумна гра: Хілер лікує, Танк захищає, Снайпер пробиває
}

//package droids;
//
//public enum AiMode {
//    AGGRESSIVE, // Всі: Атакувати найближчого/найслабшого. Рухатись вперед.
//    DEFENSIVE,  // Всі: Тримати дистанцію, використовувати захисні абілки. Тікати, якщо мало HP.
//    TACTICAL    // Хілер -> Лікувати. Танк -> Щит на союзника. Снайпер -> Фокус цілей з малою бронею/хілерів.
//}